<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Conditional</h1>
`

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">In SQL, Conditional expressions can be used in the SELECT statement, WHERE clause, and ORDER BY clause to evaluate multiple conditions. <br>These are SQL’s version of the common if…then…else statement in other programming languages.</div>

<br>
<h1 style="text-align:Left; color:black; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Types</h1><br>
<img style="display: block;margin-left: auto;margin-right: auto;width: 50%; " src="./sql_images/types_cond.png"><br><br>

In [2]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/mydb

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">CASE</h1>
`

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">CASE is a conditional statement in SQL that performs different actions based on different conditions. <br>It allows you to perform IF-THEN-ELSE logic within SQL queries. <br>It can be used in any statement or clause that allows a valid expression<br><br>
</div>

In [24]:
%sql SELECT * FROM health_ins LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[(0, 1, 39.0, 'male', 23.2, 91, 'Yes', 0, 'No', 'southeast', 1121.87),
 (1, 2, 24.0, 'male', 30.1, 87, 'No', 0, 'No', 'southeast', 1131.51)]

<br><div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">There are two forms of the CASE statement:<img style="display: block;margin-left: auto;margin-right: auto;width: 30%; " src="./sql_images/case_type.png"><br><br><ul><h2>Simple CASE expression</h2> <ol> In the simple form, the CASE statement compares an expression to a set of simple values. <br>It returns the result for the first condition that is true, similar to a series of IF-THEN-ELSE statements.<br><br>Syntax<br>(CASE column WHEN condition THEN value ELSE value END)</ol></ul><br><br>
</div>

In [27]:
%%sql 
SELECT age, gender,
(CASE age
    WHEN '39.0' THEN 'eligible'
    ELSE "Not eligible" 
END) AS 'status'

FROM health_ins
LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[(39.0, 'male', 'eligible'), (24.0, 'male', 'Not eligible')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here if age is 39.0 than return eligible otherwise return Not eligible
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul><h3>Searched CASE expression</h3> <ol> In the searched form, the CASE statement evaluates multiple conditions using the WHEN clauses.<br> It returns the result for the first condition that is true.<br><br>Syntax<br>(CASE  WHEN<br> column1 condition1 value1  column2 condition2 value2 THEN value <br>ELSE value END)</ol></ul><br><br>
</div>

In [56]:
%%sql 

SELECT age, gender, 

(CASE 
    WHEN age = 39.0 AND gender = 'male' THEN 'eligible'
    ELSE "Not eligible" 
END) AS 'status'

FROM health_ins 
LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[(39.0, 'male', 'eligible'), (24.0, 'male', 'Not eligible')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here if age is 39.0 and also gender is male than return eligible otherwise return Not eligible
</div>

In [57]:
%%sql 

SELECT age, gender, 

(CASE 
    WHEN age = 39.0 AND gender = 'male' THEN 'eligible'
    ELSE "Not eligible" 
END) AS 'status'

FROM health_ins WHERE age = 39.0 
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[(39.0, 'male', 'eligible'),
 (39.0, 'female', 'Not eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'female', 'Not eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'female', 'Not eligible'),
 (39.0, 'male', 'eligible')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">check it Condition apply on both columns age and gender
</div>

<br><br><div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Use Multiple When
</div>

In [75]:
%%sql 
SELECT *,

(CASE 

WHEN region = 'southeast' THEN 'SE' 
WHEN region = 'northwest' THEN 'NW'
ELSE 'others'

END) AS 'Short_Region'

FROM health_ins
LIMIT 49,10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[(49, 50, 30.0, 'male', 21.5, 83, 'Yes', 0, 'No', 'northeast', 1702.46, 'others'),
 (50, 51, 45.0, 'male', 23.0, 81, 'Yes', 0, 'No', 'northeast', 1704.57, 'others'),
 (51, 52, 31.0, 'male', 23.1, 81, 'Yes', 0, 'No', 'northwest', 1704.7, 'NW'),
 (52, 53, 30.0, 'male', 23.8, 91, 'Yes', 0, 'No', 'northwest', 1705.62, 'NW'),
 (53, 54, 34.0, 'male', 25.5, 82, 'Yes', 0, 'No', 'northwest', 1708.0, 'NW'),
 (54, 55, 21.0, 'male', 26.1, 87, 'Yes', 0, 'No', 'northwest', 1708.93, 'NW'),
 (55, 56, 21.0, 'male', 23.3, 80, 'Yes', 1, 'No', 'northwest', 1711.03, 'NW'),
 (56, 57, 23.0, 'male', 28.5, 88, 'Yes', 0, 'No', 'northwest', 1712.23, 'NW'),
 (57, 58, 32.0, 'male', 29.4, 97, 'No', 1, 'No', 'southeast', 1719.44, 'SE'),
 (58, 59, 50.0, 'male', 30.0, 88, 'No', 1, 'No', 'southeast', 1720.35, 'SE')]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">IF</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">IF function returns value_true if the condition is TRUE, or value_false if the condition is FALSE.<br><br>Syntax
<ul>IF (Condition, 'Value', 'ELSE Value');</ul></div>

In [80]:
%sql SELECT * FROM health_ins LIMIT 3

 * mysql+pymysql://root:***@localhost:3307/mydb
3 rows affected.

[(0, 1, 39.0, 'male', 23.2, 91, 'Yes', 0, 'No', 'southeast', 1121.87),
 (1, 2, 24.0, 'male', 30.1, 87, 'No', 0, 'No', 'southeast', 1131.51),
 (2, 3, None, 'male', 33.3, 82, 'Yes', 0, 'No', 'southeast', 1135.94)]

In [93]:
%%sql
SELECT age,gender,

IF(age=39.0, 'eligible','NOT eligible') AS 'Status' 

FROM health_ins
LIMIT 2

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[(39.0, 'male', 'eligible'), (24.0, 'male', 'NOT eligible')]

<br><br><div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Use Multiple Conditions
</div>

In [96]:
%%sql
SELECT age,gender,

IF(age=39.0 AND gender = 'male', 'eligible','NOT eligible') AS 'Status' 

FROM health_ins WHERE age = 39.0 
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[(39.0, 'male', 'eligible'),
 (39.0, 'female', 'NOT eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'female', 'NOT eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'male', 'eligible'),
 (39.0, 'female', 'NOT eligible'),
 (39.0, 'male', 'eligible')]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">NULLIF</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><br>NULLIF is a built-in conditional function in SQL Server. <br><br>The NULLIF function compares two expressions and returns NULL if they are equal Otherwise Return Expression1<br><br>Syntax
<ul>NULLIF(expression1, expression2);</ul></div>

In [101]:
%%sql
SELECT NULLIF('Mubeen','Mubeen') AS example1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(None,)]

<br><br><div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note In python Null represent as None 
</div>

In [105]:
%%sql
SELECT NULLIF('Mubeen','Mubee') AS example2

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('Mubeen',)]

<br><br><div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here Expression1 are not same with Expression2 So they return Expression1 
</div>

In [282]:
%sql SELECT * FROM random_no

 * mysql+pymysql://root:***@localhost:3307/mydb
11 rows affected.

[(6,), (6,), (0,), (0,), (0,), (6,), (0,), (6,), (6,), (0,), (6,)]

<br><br><div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here we are used NULLIF for Created Seprated 2 Columns 0 and 6 
</div>

In [313]:
%%sql
SELECT *,

NULLIF(no,0) AS 'six',
NULLIF(no,6) AS 'zero'

FROM random_no

 * mysql+pymysql://root:***@localhost:3307/mydb
11 rows affected.

[(6, 6, None),
 (6, 6, None),
 (0, None, 0),
 (0, None, 0),
 (0, None, 0),
 (6, 6, None),
 (0, None, 0),
 (6, 6, None),
 (6, 6, None),
 (0, None, 0),
 (6, 6, None)]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">COALESCE</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">The COALESCE function in SQL is used to manage NULL values in data. <br>It scans from left to right through the arguments and returns the first argument that is not NULL.<br><br>Syntax
<ul>COALESCE(value1,value2,..., valueN);</ul><br>
The COALESCE function allows handling the case where you have possible NULL values in your data and you want to replace it with some other value.
</div>

In [327]:
%sql SELECT * FROM random_no_2

 * mysql+pymysql://root:***@localhost:3307/mydb
11 rows affected.

[(0.0, 6.0),
 (None, 6.0),
 (0.0, 6.0),
 (None, 6.0),
 (None, None),
 (0.0, 6.0),
 (None, None),
 (0.0, 6.0),
 (0.0, None),
 (None, None),
 (0.0, 6.0)]

In [364]:
%%sql 
SELECT *,

COALESCE(zero,one) AS 'zero_col_fill_with_six'

FROM random_no_2

 * mysql+pymysql://root:***@localhost:3307/mydb
11 rows affected.

[(0.0, 6.0, 0.0),
 (None, 6.0, 6.0),
 (0.0, 6.0, 0.0),
 (None, 6.0, 6.0),
 (None, None, None),
 (0.0, 6.0, 0.0),
 (None, None, None),
 (0.0, 6.0, 0.0),
 (0.0, None, 0.0),
 (None, None, None),
 (0.0, 6.0, 0.0)]

<br><br><div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here zero column fill with one columns<br><ul>But here one columns also have Null values</ul>
</div>

<br><br><div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here we use one more expression if the value also none in one columns</ul>
</div>

In [365]:
%%sql 
SELECT *,

COALESCE(zero,one,"Sorry") AS 'zero_col_fill_with_six_and_Sorry'

FROM random_no_2

 * mysql+pymysql://root:***@localhost:3307/mydb
11 rows affected.

[(0.0, 6.0, '0'),
 (None, 6.0, '6'),
 (0.0, 6.0, '0'),
 (None, 6.0, '6'),
 (None, None, 'Sorry'),
 (0.0, 6.0, '0'),
 (None, None, 'Sorry'),
 (0.0, 6.0, '0'),
 (0.0, None, '0'),
 (None, None, 'Sorry'),
 (0.0, 6.0, '0')]

<br><br><div style="text-align:justify; color:black; font-size:30px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example 2</ul>
</div>

In [366]:
%%sql 
SELECT *,

COALESCE(zero,one,7) AS 'zero_col_fill_with_six_and_seven'

FROM random_no_2

 * mysql+pymysql://root:***@localhost:3307/mydb
11 rows affected.

[(0.0, 6.0, 0.0),
 (None, 6.0, 6.0),
 (0.0, 6.0, 0.0),
 (None, 6.0, 6.0),
 (None, None, 7.0),
 (0.0, 6.0, 0.0),
 (None, None, 7.0),
 (0.0, 6.0, 0.0),
 (0.0, None, 0.0),
 (None, None, 7.0),
 (0.0, 6.0, 0.0)]

In [378]:
%%sql 
SELECT gender,smoker,AVG(age) FROM health_ins
GROUP BY gender

 * mysql+pymysql://root:***@localhost:3307/mydb
2 rows affected.

[('female', 'No', 42.483383685800604), ('male', 'No', 33.74591381872214)]